app/views/events/show.html.erb


      <% @event.event_attendees.each do |attendee| %>
---
SELECT "events".* FROM "events" WHERE (date >= '2020-12-14')