app/controllers/events_controller.rb

INSERT INTO "events" ("date", "created_at", "updated_at", "name", "creator_id", "description") VALUES (?, ?, ?, ?, ?, ?)  [["date", "1584-06-26"], ["created_at", "2020-12-11 14:40:29.791673"], ["updated_at", "2020-12-11 14:40:29.791673"], ["name", "asdf"], ["creator_id", 1], ["description", "wsetg"]]
---
  def create
    @user = current_user
    @event = @user.created_events.build(event_params)
    if @event.save