app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE (date >= '2020-12-11')
---
  def index
    if current_user.nil?
      redirect_to '/login'
    else
      @events = Event.all

INSERT INTO "events" ("date", "created_at", "updated_at", "name", "creator_id", "description") VALUES (?, ?, ?, ?, ?, ?)  [["date", "1584-06-26"], ["created_at", "2020-12-11 14:40:29.791673"], ["updated_at", "2020-12-11 14:40:29.791673"], ["name", "asdf"], ["creator_id", 1], ["description", "wsetg"]]
---
  def create
    @event = current_user.events.build(event_params)
    respond_to do |format|
      if @event.save