app/controllers/sessions_controller.rb

    def create
        user = User.find_by_user_name(params[:session][:user_name].downcase)
---
SELECT "users".* FROM "users" WHERE "users"."user_name" = ? LIMIT ?  [["user_name", "zr"], ["LIMIT", 1]]