app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "user_name") VALUES (?, ?, ?)  [["created_at", "2020-12-11 14:40:05.997823"], ["updated_at", "2020-12-11 14:40:05.997823"], ["user_name", "karthy"]]
---
    def create

        user = User.new
        user.user_name = (params[:user][:user_name])
        if user.save